tap "homebrew/core"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "buo/cask-upgrade"

# set arguments for all 'brew install --cask' commands
cask_args appdir: "~/Applications"

brew "direnv"
brew "git"
brew "exa"
brew "bat"
brew "gpg"
brew "asdf"
brew "pnpm"
brew "ripgrep"
brew "fzf"
brew "luajit", args: ['HEAD']
brew "neovim", args: ['HEAD']
brew "tmux"
brew "tmuxinator"
brew "pyenv"
brew "pyenv-virtualenv"
brew "starship"

cask "iterm2"
cask "maccy"
cask "brave-browser"
cask "spotify"
cask "vlc"
